# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count, cycle

for i in count(1):
    print(i)
    if i == 15:
        break

rainbow = ['red', 'orange', 'yellow', 'green', 'blue', 'navy', 'purple']
el = 0
for i in cycle(rainbow):
    if el > 15:
        break
    print(i)
    el += 1
